Show / Hide Table of Contents
Interface IMemberHiddenCheck
Provides seamlessly data about connections or allows to run hidden calculation of a connection
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[ServiceContract]
public interface IMemberHiddenCheck
Methods
Improve this Doc   View Source
Calculate(Int32)
Declaration
[OperationContract]
string Calculate(int subStructureId)
Parameters
 Type |  Name |  Description
 System.Int32 |  subStructureId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
Cancel()
Cancel current calcullation
Declaration
[OperationContract]
void Cancel()
Improve this Doc   View Source
CloseProject()
Close project which is open in the service
Declaration
[OperationContract]
void CloseProject()
Improve this Doc   View Source
OpenProject(String)
Open idea project in the service
Declaration
[OperationContract]
void OpenProject(string projectLocation)
Parameters
 Type |  Name |  Description
 System.String |  projectLocation
 Improve this Doc
 View Source